"""
输入2位整数
如果输入的不是2位数，则提示：“输入的不是2位数！
否则说明是2位数，则判断内容中是否含有字母、符号（例如“/”、“+”等）等非法字符
如果含有非法字符，则提示：“含有非法字符！
否则：A) 如果第1位是0，则提示 "第一个数字不能为0！"
             B) 如果是偶数，则提示：“合法！输入的是偶数：**”
             C) 否则是奇数，则提示：“合法！输入的是奇数：**
"""
s = input("请输入2位整数:")
if len(s) != 2:
    print("输入的不是2位数")
else:
    for i in s:
        if i not in ["1", "2", "3", "4", "5", "6", "7", "8", "9", "0"]:
            print("含有非法字符！")
            break
    else:
        if s[0] == "0":
            print("第一个数字不能为0！")
        elif int(s) % 2 == 0:
            print(f"合法！输入的是偶数：{s}")
        else:
            print(f"合法！输入的是奇数：{s}")

# if len(s) != 2:
#     print("输入的不是2位数")
#
# elif not str.isdigit(s):
#     print("含有非法字符！")
# else:
#     if s[0] == "0":
#         print("第一个数字不能为0！")
#     elif int(s) % 2 == 0:
#         print(f"合法！输入的是偶数：{s}")
#     else:
#         print(f"合法！输入的是奇数：{s}")